<a href="https://colab.research.google.com/github/1st-award/andong_2021_2_1/blob/main/Python/%ED%95%84%EA%B8%B0%20%EC%82%AC%EB%B3%B8/pandas_basic_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# pandas 라이브러리
pandas는
- 파이썬프로그래밍 언어를 기반으로 구축된 데이터분석 및 조작 라이브러리
- 빠르고 강력하고 유연하며 사용하기 쉬운 오픈 소스
- 2008년 AQR Capital Management에서 처음 개발
- 2009년 말 오픈 소스로 개방
- 현재 전 세계의 커뮤니케이터들의 기여로 지속적으로 업데이트
특히, 행과 열로 이루어진 표 형태의 데이터 객체를 만들고 처리할 수 있으며 보다 안정적으로 대용량의 데이터들을 처리하는데 매우 편리하다.

**pandas를 사용하기에 앞서 numpy와 pandas 라이브러리를 import 하자.**

In [ ]:
import numpy as np
import pandas as pd

## pandas 자료구조
- Series
- DataFrame

### Series
일련의 자료를 담을 수 있는 1차원 배열과 같은 자료구조로, Series의 실제 데이터는 numpy의 1차원 array 구조로 저장

#### Series의 생성

정수형 인덱스를 갖는 시리즈(Series)의 생성

In [ ]:
sc = pd.Series([98, 77, 100, 64])
print(sc)

0     98
1     77
2    100
3     64
dtype: int64

##### Series 객체는 색인(Index)과 값(Values)을 갖는다.

In [ ]:
# 시리즈의 색인 확인
print(sc.index)

RangeIndex(start=0, stop=4, step=1)

In [ ]:
# 시리즈의 값 확인
print(sc.values)

array([ 98,  77, 100,  64])

##### 문자열을 이용한 색인

In [ ]:
obj = pd.Series([69, 77, 100, 75], index= ['a', 'b', 'c', 'd'])
print(obj)

a     69
b     77
c    100
d     75
dtype: int64

In [ ]:
# 사전 구조를 이용한 시리즈의 생성
dic = {'a': 69, 'b': 77, 'c': 100, 'd': 75}
obj = pd.Series(dic)
print(obj)

a     69
b     77
c    100
d     75
dtype: int64

In [ ]:
score = pd.Series([96, 88, 100, 68], index=['김은서', '박민철', '정윤주', '홍길동'])
print(score)

김은서     96
박민철     88
정윤주    100
홍길동     68
dtype: int64

#### 색인을 이용한 데이터 검색

In [ ]:
score['정윤주']
# score[2]

##### 색인을 이용한 데이터 수정

In [ ]:
score['박민철'] = 85
score


##### 특정 조건을 만족하는 값을 가진 데이터 검색

In [ ]:
# 점수가 80점 이상인 데이터들을 검색하여 출력
score[score>=80]

#### Series 요소의 연산

##### pandas 데이터 객체의 모든 요소에 한꺼번에 스칼라 연산이 가능하다.

In [ ]:
obj1 = pd.Series([1, 3, 5, 7, 9])
obj2 = obj1 * 2
print(obj2)

##### pandas의 데이터 객체에 numpy함수를 적용할 수 있다.

In [ ]:
obj1 = pd.Series([1, 3, 5, 7, 9])
obj2 = np.sqrt(obj1)
print(obj2)

#### 코로나19 데이터를 이용한 Series 연습

##### **사전을 이용한 시리즈의 생성**

In [ ]:
#2021-04-19
covid19 = {'서울': 35628, '대구': 9176, '경기': 31946, '경북': 3843, '인천': 5488, '광주': 2295, '충남': 2886, '부산': 4670}
covid_19 = pd.Series(covid19)
covid_19

In [ ]:
covid_19 = pd.Series([35628, 9176, 31946, 3843, 5488, 2295, 2886, 4670], index=['세울', '대구', '경기', '경북', '안천', '광주', '충남', '부산'])
covid_19

##### **색인(Index) 변경**

In [ ]:
# covid_19.index = ['서울', '대구', '경기', '경북', '인천', '광주', '충남', '부산']
covid_19 = covid_19.rename({'세울': '서울', '안천': '인천'})
covid_19

In [ ]:
covid_19.name = '2021-04-19 COVID19 확진자 수'
covid_19.index.name = '지역'
covid_19

### DataFrame
numpy의 2차원 array와 유사

####DataFrame의 생성

In [ ]:
data = {'지역': ['서울', '대구', '경기', '경북', '인천', '광주', '충남', '부산'], 
        '2020-10-19': [5702, 7142, 4869, 1573, 999, 502, 505, 571], 
        '2021-04-19': [35628, 9176, 31946, 3843, 5488, 2295, 2886, 4670]}
covid_19f = pd.DataFrame(data)
covid_19f.name = '2020년 10월과 2021년 4월의 COVID19 확진자 수 비교'
covid_19f

   지역  2020-10-19  2021-04-19
0  서울        5702       35628
1  대구        7142        9176
2  경기        4869       31946
3  경북        1573        3843
4  인천         999        5488
5  광주         502        2295
6  충남         505        2886
7  부산         571        4670

##### '지역' 칼럼을 인덱스로 사용

In [ ]:
covid_19f = covid_19f.set_index('지역')
covid_19f

    2020-10-19  2021-04-19
지역
서울        5702       35628
대구        7142        9176
경기        4869       31946
경북        1573        3843
인천         999        5488
광주         502        2295
충남         505        2886
부산         571        4670

##### head()함수: 처음 5개의 행만 출력

In [ ]:
covid_19f.head()

    2020-10-19  2021-04-19
지역
서울        5702       35628
대구        7142        9176
경기        4869       31946
경북        1573        3843
인천         999        5488

##### 사전에 없는 값을 넘기면 결측치로 저장

In [ ]:
co210419 = pd.DataFrame(covid_19f, columns = ['2021-04-19', '격리해제', '사망', '완치율'])
co210419

    2021-04-19  격리해제  사망  완치율
지역
서울       35628   NaN NaN  NaN
대구        9176   NaN NaN  NaN
경기       31946   NaN NaN  NaN
경북        3843   NaN NaN  NaN
인천        5488   NaN NaN  NaN
광주        2295   NaN NaN  NaN
충남        2886   NaN NaN  NaN
부산        4670   NaN NaN  NaN

##### 칼럼명 변경

In [ ]:
co210419 = co210419.rename({'2021-04-19': '확진'}, axis=1)
co210419

       확진  격리해제  사망  완치율
지역
서울  35628   NaN NaN  NaN
대구   9176   NaN NaN  NaN
경기  31946   NaN NaN  NaN
경북   3843   NaN NaN  NaN
인천   5488   NaN NaN  NaN
광주   2295   NaN NaN  NaN
충남   2886   NaN NaN  NaN
부산   4670   NaN NaN  NaN

##### 결측치를 가진 칼럼에 값을 대입

In [ ]:
co210419['격리해제'] = 0
co210419['사망'] = 0
co210419['완치율'] = 0.0
co210419

       확진  격리해제  사망  완치율
지역
서울  35628     0   0  0.0
대구   9176     0   0  0.0
경기  31946     0   0  0.0
경북   3843     0   0  0.0
인천   5488     0   0  0.0
광주   2295     0   0  0.0
충남   2886     0   0  0.0
부산   4670     0   0  0.0

In [ ]:
co210419['격리해제'] = [32468, 4009, 28842, 3515, 5210, 2207, 2652, 4009]
co210419['사망'] = [443, 219, 570, 77, 58, 21, 36, 121]
co210419

       확진   격리해제   사망  완치율
지역
서울  35628  32468  443  0.0
대구   9176   4009  219  0.0
경기  31946  28842  570  0.0
경북   3843   3515   77  0.0
인천   5488   5210   58  0.0
광주   2295   2207   21  0.0
충남   2886   2652   36  0.0
부산   4670   4009  121  0.0

###### 완치율 계산

In [ ]:
co210419['완치율'] = co210419['격리해제']/co210419['확진']
co210419

       확진   격리해제   사망       완치율
지역
서울  35628  32468  443  0.911306
대구   9176   4009  219  0.436901
경기  31946  28842  570  0.902836
경북   3843   3515   77  0.914650
인천   5488   5210   58  0.949344
광주   2295   2207   21  0.961656
충남   2886   2652   36  0.918919
부산   4670   4009  121  0.858458

#### DataFrame의 전치 (행과 열을 뒤집음)

In [ ]:
co210419.T

In [ ]:
co210419 = co210419.astype({'확진': 'Int32', '격리해제': 'Int32', '사망': 'Int32'})
co210419.T

지역          서울        대구        경기  ...        광주        충남        부산
확진       35628      9176     31946  ...      2295      2886      4670
격리해제     32468      4009     28842  ...      2207      2652      4009
사망         443       219       570  ...        21        36       121
완치율   0.911306  0.436901  0.902836  ...  0.961656  0.918919  0.858458

[4 rows x 8 columns]

#### DataFrame 편집
##### 재색인

In [ ]:
# obj_s = pd.Series(np.arange(5.0), index=['d', 'b', 'a', 'c', 'e'])
obj_s = pd.Series([0.0, 1.0, 2.0, 3.0, 4.0], index=['d', 'b', 'a', 'c', 'e'])
obj_s

d    0.0
b    1.0
a    2.0
c    3.0
e    4.0
dtype: float64

In [ ]:
obj_s = obj_s.reindex(['a', 'b', 'c', 'd', 'e'])
obj_s

In [ ]:
co210419 = co210419.reindex(['서울', '경기', '대구', '인천', '부산', '광주', '충남', '광주'])
co210419

       확진   격리해제   사망       완치율
지역
서울  35628  32468  443  0.911306
경기  31946  28842  570  0.902836
대구   9176   4009  219  0.436901
인천   5488   5210   58  0.949344
부산   4670   4009  121  0.858458
광주   2295   2207   21  0.961656
충남   2886   2652   36  0.918919
광주   2295   2207   21  0.961656

##### drop()매서드를 이용한 행 또는 열 삭제

In [ ]:
# 한 개의 행 삭제
obj_new = obj_s.drop('c')
obj_new

d    0.0
b    1.0
a    2.0
e    4.0
dtype: float64

In [ ]:
# 두 개 이상의 행 삭제
obj_new = obj_new.drop(['b', 'd'])
obj_new

a    2.0
e    4.0
dtype: float64

In [ ]:
new_co210419 = co210419.drop('인천')
new_co210419

       확진   격리해제   사망       완치율
지역
서울  35628  32468  443  0.911306
경기  31946  28842  570  0.902836
대구   9176   4009  219  0.436901
부산   4670   4009  121  0.858458
광주   2295   2207   21  0.961656
충남   2886   2652   36  0.918919
광주   2295   2207   21  0.961656

In [ ]:
# DataFrame의 행 삭제 - 충남, 광주, 인천
new_co210419 = co210419.drop(['충남','광주', '인천'])
new_co210419

       확진   격리해제   사망       완치율
지역
서울  35628  32468  443  0.911306
경기  31946  28842  570  0.902836
대구   9176   4009  219  0.436901
부산   4670   4009  121  0.858458

In [ ]:
# DataFrame 열 삭제 - '삭제'
new_co210419 = new_co210419.drop('사망', axis=1)
new_co210419

##### 데이터프레임 co210419의 '확진'칼럼을 기준으로 내림차순 정렬

In [ ]:
co210419_s = co210419.sort_values(by=["확진"], ascending= False)
co210419_s

#### DataFrame의 슬라이싱
##### 슬라이싱을 이용하여 확진자 수가 가장 많은 세 지역 정보로 새로운 데이터 프레임 co2104919_top3을 생성

In [ ]:
co210419_top3 = co210419_s[:3]
co210419_top3

##### head() 함수를 이용하여 확진자 수가 가장 많은 세 지역 정보로 새로운 데이터 프레임 co210419_top3을 생성

In [ ]:
co210419_top3 = co210419_s.head(3)
co210419_top3

##### head() 함수를 이용하여 확진자 수가 가장 적은 세 지역 정보로 새로운 데이터 프레임 co210419_top3을 생성

In [ ]:
co210419_top3 = co210419_s.tail(3)
co210419_top3